<?php
function ch1()
{
//Часть 1. Задание 1
    $a = 3;
    $b = $a;
    echo($b);

//Задание 2
    $a = 10;
    $b = 2;
    $sum = ($a + $b) / 2;
    $ras = ($a - $b) / 2;
    $umn = ($a * $b) / 2;
    $del = ($a / $b) / 2;

//Задание 3
    $c = 15;
    $d = 2;
    $result = $c + $d;
    return $result;

//Задание 4
    $a = 10;
    $b = 2;
    $c = 5;
    $avg = (10 + 2 + 5) / 3;
    echo ($a + $b + $c) / $avg;

//Задание 5
    $a = 17;
    $b = 10;
    $c = $a - $b;
    $d = 17;
    $result = $c + $d;
    return $result;
}

function ch2(){
//Часть 2. Задание 1
    $text = 'Привет, Мир!';
    echo $text.'Моя первая программа';

    //Задание 2
    $text1 = 'Привет, ';
    $text2 = 'Мир!';
    echo $text1.$text2;

    //Задание 3
    $name = 'Panda';
    echo 'Привет, '.$name;
    $text = 'Новый текст';


    //Задание 4
    $age = 10;
    $height = 136;
    echo 'Мой возраст : '.$age.' | Мой рост : '.$height;

    //Задание 5
    $text  = 'abcde';
    echo $text[0];
    echo $text[2];
    echo $text[4];
}

function ch3(){
    //Часть 3. Задание 1
    $arr = ['a','b','c'];
    var_dump($arr);
    echo $arr[0];
    echo $arr[1];
    echo $arr[2];

    //Задание 2
    echo $arr[0].$arr[1].$arr[2];

    //Задание 3
    $arr = ['a','b','c','d'];
    echo $arr[0].'+'.$arr[1].' '.$arr[2].'-'.$arr[3].' '.$arr[0].'-'.$arr[3].' '.$arr[0].'/'.$arr[3];

    //Задание 4
    $arr = [2,5,3,9];
    $result = ($arr[0] * $arr[1])+($arr[2] * $arr[4]);
    echo $result;

    //Задание 5
    $arr[] = 1;
    $arr[] = 2;
    $arr[] = 3;
    $arr[] = 4;
    $arr[] = 5;
}

function ch4(){
    //Часть 4. Задание 1
    $arr = ['a'=>11,'d'=>20,'c'=>30];
    echo $arr['c'];

    //Задание 2
    $arr = ['q3'=>12, 'r3'=>23, 'f3'=>34];
    echo $arr['q3'] + $arr['r3'] + $arr['f3'];

    //Задание 3
    $arr = ['Коля'=>'1000$', 'Вася'=>'500$', 'Петя'=>'200$'];
    echo 'Зарплата Пети : '.$arr['Коля'];
    echo 'Зарплата Коли : '.$arr['Петя'];

    //Задание 4
    $arr = ['01'=>'Январь', '02'=>'Февраль', '03'=>'Март',
        '04'=>'Апрель', '05'=>'Май', '06'=>'Июнь',
        '07'=>'Июль', '08'=>'Август', '09'=>'Сентябрь',
        '10'=>'Октябрь', '11'=>'Ноябрь', '12'=>'Декабрь'];
    echo $arr['09'];
    echo $arr['06'];

    //Задание 5
    $arr = ['1'=>'Понедельник', '2'=>'Вторник', '3'=>'Среда',
        '4'=>'Четверг', '5'=>'Пятница', '6'=>'Суббота', '7'=>'Воскресенье'];
    $day = 3;
    echo $arr[$day];
}